app/Controllers/Alta.php

    public function index()
    {
        $message = session('message');
        $data["message"] = $message;
        $data['cabecera'] = view('template/cabecera');

        $owner = new OwnersModel();
        $data['owners'] = $owner->findAll();
---
SELECT *
FROM `owners`

            'creation_date' => $creation_date
        );

        if ($petModel->insert($data)) {
---
INSERT INTO `pets` (`name`, `race`, `age`, `creation_date`) VALUES ('ñam', 'ñam', '7', '2023-06-10')

            'creation_date' => $creation_date,
        );

        if ($veterinarianModel->insert($data)) {
---
INSERT INTO `veterinarians` (`name`, `surname`, `speciality`, `phone_number`, `admission_date`) VALUES ('ñam', 'ñaá', 'ñappss', '5435543534', '2023-06-13')