app/Controllers/Modificar.php

SELECT *
FROM `owners`
SELECT *
FROM `pets`
SELECT *
FROM `veterinarians`
---
    public function index()
    {
        $message = session('message');
        $data['message'] = $message;
        $data['cabecera'] = view('template/cabecera');
        $owner = new OwnersModel();
        $data['owners'] = $owner->findAll();

        $pet = new PetsModel();
        $data['pets'] = $pet->findAll();

        $veterinarian = new veterinariansModel();
        $data['veterinarians'] = $veterinarian->findAll();

SELECT *
FROM `veterinarians`
WHERE `veterinarians`.`id` = '9'
---
    public function editar()
    {
        $data['cabecera'] = view('template/cabecera');
        if (isset($_POST['id']) || session('id')) {

            if (isset($_POST['id'])) {
                $value = $this->request->getPost('editar');
                $id = $this->request->getPost('id');
            } else if (session('value')) {
                $value = session('value');
                $id = session('id');
            }

            switch ($value) {
                case 1:
                    $owner = new OwnersModel();
                    $data['owner'] = $owner->find($id);
                    $data['value'] = 1;
                    break;
                case 2:
                    $pet = new PetsModel();
                    $data['pet'] = $pet->find($id);
                    $data['value'] = 2;
                    break;
                case 3:
                    $veterinarian = new VeterinariansModel();
                    $data['veterinarian'] = $veterinarian->find($id);

UPDATE `veterinarians` SET `name` = 'Lucianita', `surname` = 'Jofre', `speciality` = 'Neurocirujana', `phone_number` = '12345677', `admission_date` = '2023-05-12'
WHERE `veterinarians`.`id` IN ('9')
---
                'admission_date' => $this->request->getPost('admission_date'),
            );

            if ($veterinarian->update($id_veterinarian, $data)) {