app/Controllers/Mostrar.php

    public function index()
    {
        $data['cabecera'] = view('template/cabecera');

        $owner = new OwnersModel();
        $data['owners'] = $owner->findAll();

        $pet = new PetsModel();
        $data['pets'] = $pet->findAll();

        $veterinarian = new VeterinariansModel();
        $data['veterinarians'] = $veterinarian->findAll();
---
SELECT *
FROM `owners`
SELECT *
FROM `pets`
SELECT *
FROM `veterinarians`