app/Models/OwnersPetsModel.php

SELECT `op`.`id`, `o`.`name` as `nameO`, `o`.`surname`, `p`.`name` as `nameP`, `p`.`race`, `op`.*
FROM `owners_pets` `op`
JOIN `owners` `o` ON `o`.`id`=`op`.`owner_id`
JOIN `pets` `p` ON `p`.`id`=`op`.`pet_id`
WHERE `owner_id` = 27
---
    public function join_owner_pet($where){

        $db      = \Config\Database::connect();
        $builder = $db->table('owners_pets op');
        $builder->select('op.id,o.name as nameO,o.surname,p.name as nameP,p.race,op.*')
        ->join('owners o','o.id=op.owner_id')
        ->join('pets p','p.id=op.pet_id')
        ->where($where);

        $data = $builder->get()->getResultArray();