app/Models/VeterinariansPetsModel.php

SELECT `vp`.`id`, `v`.`name` as `nameV`, `v`.`surname`, `v`.`speciality`, `p`.`name` as `nameP`, `p`.`race`, `vp`.*
FROM `veterinarians_pets` `vp`
JOIN `veterinarians` `v` ON `v`.`id`=`vp`.`veterinarian_id`
JOIN `pets` `p` ON `p`.`id`=`vp`.`pet_id`
WHERE `veterinarian_id` = 9
---
    public function join_veterinarian_pet($where){

        $db      = \Config\Database::connect();
        $builder = $db->table('veterinarians_pets vp');
        $builder->select('vp.id,v.name as nameV,v.surname,v.speciality,p.name as nameP,p.race,vp.*')
        ->join('veterinarians v','v.id=vp.veterinarian_id')
        ->join('pets p','p.id=vp.pet_id')
        ->where($where);

        $data = $builder->get()->getResultArray();