app/Models/VeterinariansModel.php

    public function getEgressDate(){
        $db      = \Config\Database::connect();
        $builder = $db->table('veterinarians');
        $builder->select('*');
        //$where = 'egress_date IS NULL';
        $builder->where('egress_date IS NULL',NULL,FALSE);

        $data = $builder->get()->getResultArray();
---
SELECT *
FROM `veterinarians`
WHERE egress_date IS NULL